:PROPERTIES:
:ID:       4fd036f0-8812-411d-bd25-acd1ebefb7d9
:END:
#+title: Forecasting elections in multiparty systems: a Bayesian approach combining polls and fundamentals
#+filetags: :public:
#+PROPERTY: header-args:latex :results raw :exports results

Uses the backward random-walk approach taken in [[id:ff4c4ac1-a8ee-4f8b-9364-6079b1aac093][Linzer2013]] and [[id:909b0360-acda-4307-821f-fd60db661ae2][Strauss2007]], and includes two models that are fully integrated:

- The /fundamentals-based model/ that provides a forecast for each  party's results way ahead of the election;
- The /measurement model/ that estimates the current level of party support (poll agregator).

  #+begin_src latex
\begin{equation}
  \mathbf{y}_{ct} \sim \operatorname{Multinomial}(\mathbf{\pi_{ct}^{*}}, N_{ct})
\end{equation}
  #+end_src

  #+RESULTS:
  \begin{equation}
    \mathbf{y}_{ct} \sim \operatorname{Multinomial}(\mathbf{\pi_{ct}^{*}}, N_{ct})
  \end{equation}

  The latent underlying support is normalized to sum to $1$ using a log-transform:

  #+begin_src latex
\begin{align*}
  \mathbf{\pi}_{ct} &= \left(\log\left(\frac{\pi^{*}_{ct1}}{\pi^{*}_{ctP}}\right), \dots, \log \left(\frac{\pi^{*}_{ct(P-1)}}{\pi^{*}_{ctP}}\right)\right)\\
  &= \alpha_{t} + \delta_c
\end{align*}
  #+end_src

  #+RESULTS:
  \begin{align*}
    \mathbf{\pi}_{ct} &= \left(\log\left(\frac{\pi^{*}_{ct1}}{\pi^{*}_{ctP}}\right), \dots, \log \left(\frac{\pi^{*}_{ct(P-1)}}{\pi^{*}_{ctP}}\right)\right)\\
    &= \alpha_{t} + \delta_c
  \end{align*}

  Q: /Why not using a $\operatorname{Softmax}$ function instead?/

  And $\alpha_t = \alpha_{t+1} + \omega_t$ where $\omega_t \sim \operatorname{Normal}(0, W)$, and the $W_{i,j}$ covary.


The latent state of party support $\alpha_T$ on election day (with predictors $x_E$ that day) is given by

#+begin_src latex
\begin{equation}
  P(\alpha_{T}|x_{E}) = \operatorname{alr}\left(\int_{\theta}P(v_{E}|\theta, x_{E})P(\theta|V,X)\mathrm{d}\theta\right)
\end{equation}

#+end_src

#+RESULTS:
\begin{equation}
  P(\alpha_{T}|x_{E}) = \operatorname{alr}\left(\int_{\theta}P(v_{E}|\theta, x_{E})P(\theta|V,X)\mathrm{d}\theta\right)
\end{equation}

In other words, the prediction of the fundamental model and the intentions coimputed by the poll aggregator should somehow coincide. Joint posterior distribution of both the fundamentals model and the dynamics poll modelL

#+begin_src latex
\begin{align*}
  \mathcal{L}_{poll} &= P(Y|\alpha, \delta, W)\,\left(\prod_{t=1}^{T} P(\mathbf{\alpha}_{t}|\mathbf{\alpha}_{t+1}, W)\right)\,P(W)\,P(\delta)\\
  \mathcal{L}_{fund} &= P(V|\theta, X)\, P(\theta)\\
  \mathcal{L} &= \mathcal{L}_{fund}\,\mathcal{L}_{poll}\,P(\alpha_T|x_E)
\end{align*}
#+end_src

#+RESULTS:
\begin{align*}
  \mathcal{L}_{poll} &= P(Y|\alpha, \delta, W)\,\left(\prod_{t=1}^{T} P(\mathbf{\alpha}_{t}|\mathbf{\alpha}_{t+1}, W)\right)\,P(W)\,P(\delta)\\
  \mathcal{L}_{fund} &= P(V|\theta, X)\, P(\theta)\\
  \mathcal{L} &= \mathcal{L}_{fund}\,\mathcal{L}_{poll}\,P(\alpha_T|x_E)
\end{align*}

[[id:b7fbd68f-d171-4627-9691-80156939ab12][Integrate polls aggregation and fundamentals predictions]]
